[["2013-04-08T00:00:00", ["Abu Bakr al-Baghdadi, the leader of al-Qaida's branch in Iraq, announces the merger of his group with al-Qaida's franchise in Syria, forming the Islamic State in Iraq and the Levant."]], ["2014-01-04T00:00:00", ["Al-Baghdadi's forces seize control of the city of Fallujah in western Iraq and parts of the nearby provincial capital of Ramadi."]], ["2014-01-13T00:00:00", ["In Syria, they seize sole control of the city of Raqqa after driving out rival Syrian rebel factions, and it becomes their de facto capital."]], ["2014-02-03T00:00:00", ["Al-Qaida leader Ayman al-Zawahri disavows al-Baghdadi after the Iraqi militant ignores his demands that IS leave Syria."]], ["2014-06-10T00:00:00", ["IS captures Mosul, Iraqi's second-largest city, and pushes south as Iraqi forces crumble, eventually capturing Saddam Hussein's hometown of Tikrit and reaching the outskirts of Baghdad.", "When they threaten Shiite holy sites, Iraq's top Shiite cleric issues a call to arms, and masses of volunteers, largely backed and armed by Iran, join militias."]], ["2014-06-29T00:00:00", ["The group renames itself the Islamic State and declares the establishment of a self-styled caliphate, a traditional model of Islamic rule, in its territories in Iraq and Syria.", "Al-Baghdadi is declared the caliph."]], ["2014-07-04T00:00:00", ["Al-Baghdadi makes his first public appearance, delivering a Friday sermon in Mosul's historic al-Nuri Mosque.", "He urges Muslims around the world to swear allegiance to the caliphate and obey him as its leader."]], ["2014-08-03T00:00:00", ["IS captures the town of Sinjar west of Mosul and begins a systematic slaughter of the tiny Yazidi religious community.", "Women and girls are kidnapped as sex slaves; hundreds remain missing to this day."]], ["2014-08-08T00:00:00", ["The U.S. launches its campaign of airstrikes against IS in Iraq."]], ["2014-09-22T00:00:00", ["The U.S.-led coalition begins an air campaign against IS in Syria."]], ["2015-01-25T00:00:00", ["Iraqi Kurdish fighters, backed by U.S.-led airstrikes, drive IS out of several towns north of Mosul.", "In Syria, Kurdish fighters backed by U.S. airstrikes repel an IS onslaught on Kobani, a town on the border with Turkey, in the first significant defeat for IS."]], ["2015-04-01T00:00:00", ["U.S.-backed Iraqi forces retake Tikrit, their first major victory against IS."]], ["2015-05-20T00:00:00", ["IS captures the ancient Syrian town of Palmyra, where the extremists later destroy archaeological treasures."]], ["2016-02-09T00:00:00", ["Iraqi forces recapture Ramadi after months of fighting and at enormous cost, with thousands of buildings destroyed.", "Almost the entire population fled."]], ["2016-06-26T00:00:00", ["Fallujah is declared liberated by Iraqi forces after a five-week battle."]], ["2016-07-03T00:00:00", ["IS sets off a gigantic suicide truck bomb outside a Baghdad shopping mall, killing almost 300 people, the deadliest attack in Iraq since the 2003 U.S.-led invasion."]], ["2016-10-17T00:00:00", ["Iraqi Prime Minister Haider al-Abadi announces the start of the operation to liberate Mosul."]], ["2016-11-05T00:00:00", ["The U.S.-backed, Kurdish-led Syrian Democratic Forces (SDF) launch Operation Euphrates Wrath, the first of five operations aiming to retake Raqqa, starting with an encircling of the city."]], ["2017-01-24T00:00:00", ["Al-Abadi announces eastern Mosul has been fully liberated."]], ["2017-05-10T00:00:00", ["SDF captures the strategic Tabqa dam after weeks of battles and a major airlift operation that brought SDF fighters and their U.S. advisers to the area.", "The fall of the dam facilitated the push on Raqqa, about 40 kilometers (25 miles) away."]], ["2017-06-06T00:00:00", ["SDF fighters begin an attack on Raqqa from three sides, backed by U.S.-led airstrikes."]], ["2017-06-18T00:00:00", ["Iraqi forces launch battle for Mosul's Old City, the last IS stronghold there."]], ["2017-06-21T00:00:00", ["IS destroys Mosul's iconic al-Nuri Mosque and its 12th century leaning minaret as Iraqi forces close in."]], ["2017-07-10T00:00:00", ["Iraqi prime minister declares victory over IS in Mosul and end of the extremists' caliphate in Iraq."]], ["2017-10-17T00:00:00", ["SDF takes full control of Raqqa after months of heavy bombardment that devastates the city."]], ["2018-08-23T00:00:00", ["IS leader al-Baghdadi resurfaces in his first purported audio recording in almost a year, and he urges followers to continue fighting."]], ["2018-09-10T00:00:00", ["SDF launches a ground offensive, backed by U.S.-led airstrikes, to take the last territory held by IS in Syria's eastern province of Deir el-Zour."]], ["2019-03-23T00:00:00", ["SDF declares the complete capture of Baghouz and the end of the Islamic State group's territorial caliphate."]], ["2019-10-27T00:00:00", ["U.S. President Donald Trump says al-Baghdadi died Saturday after a nighttime airborne raid by American special operations forces in Syria's northwestern Idlib province when he detonated a suicide vest in a tunnel while running away."]]]
