{
  "egypt crisis": [
    "What were the key events and decisions leading up to the resignation of President Hosni Mubarak in February 2011?", 
    "How did various political parties and groups in Egypt, both Islamist and secular, influence the drafting and opposition of the new constitution in 2012?", 
    "What international reactions and diplomatic efforts were involved during the peak of the Egyptian crisis between 2011 and 2013, specifically from neighboring countries in the Middle East?", 
    "What were the effects of the 2011-2013 Egypt crisis on regional geopolitics in the Middle East and North Africa?",
    "Who were the major opposition leaders and political figures in Egypt during the constitutional crisis of 2012, and what were their main agendas?"
  ],
  "libya crisis": [
    "What were the key factors leading to the initial anti-Gadhafi demonstrations in Libya in February 2011?", 
    "What were the initial international diplomatic responses and strategies regarding Libya following the 2011 NATO intervention?", 
    "What role did tribal and regional dynamics within Libya play throughout the country's conflict from 2011 onwards?", 
    "What role did social media play in organizing protests and gaining international attention during the initial stages of the Libyan uprising?", 
    "What are the significant humanitarian challenges that Libya has faced since the beginning of the crisis, and how have international aid efforts responded over the years?"
  ],
  "syria crisis": [
    "What were the key events that led to the initial outbreak of protests in Syria in March 2011?", 
    "How did the involvement of international actors, including Russia, Iran, the United States, and neighboring Arab states, evolve in the Syrian crisis from 2011 to 2023?", 
    "What are the key factors that have influenced the shifts in territorial control among various factions within Syria over the years?", 
    "What were the key international diplomatic efforts and their outcomes related to the Syria crisis from 2014 to 2023?", 
    "How did the Syrian government's strategies and tactics change in response to the evolving military and political landscape from 2011 onwards?"
  ],
  "yemen crisis": [
    "What impact has the political and military power of tribal alliances and leaders had on the Yemen crisis from the beginning of protests against Ali Abdullah Saleh in 2011 through subsequent years?", 
    "What have been the major peace initiatives or agreements proposed or implemented since 2011, and what were their outcomes or reasons for failure?", 
    "Who were the main internal and external players involved in the mediation efforts to resolve the Yemen crisis, and what roles did they play?", 
    "How have foreign nations, particularly regional powers, influenced the Yemen crisis from the start of the conflict to the present day?", 
    "How have international entities, such as the United Nations and Gulf Cooperation Council, attempted to mediate the Yemen crisis from its onset in 2011 to the present?" 
  ],
  "bp oil spill": [
    "What were the initial design and safety considerations for the Deepwater Horizon drilling rig prior to its construction and deployment?", 
    "How did the financial performance and stock market valuation of BP change from before to several years after the oil spill?", 
    "How did BP's crisis management strategies evolve from the onset of the spill until its containment, and which BP executives were directly involved in decision-making during this period?", 
    "What were the long-term environmental impacts observed in the Gulf of Mexico and adjacent regions over the decade following the spill?", 
    "How have BP's corporate policies and leadership strategies changed in response to the fallout from the oil spill, and what subsequent incidents or improvements have occurred?"
  ],
  "egyptian crisis": [
    "How did social media platforms impact the organization and spread of protests during the Egyptian crisis?", 
    "Who were the major domestic political groups involved in the Egyptian crisis, and how did their agendas and actions evolve throughout the period of unrest?", 
    "What was the role and response of the Egyptian military throughout the 2011 crisis and the eventual transition of power?", 
    "Who were the major opposition figures during the Egyptian crisis, and what roles did they play in the subsequent political developments?", 
    "What were the key factors that led to Hosni Mubarak's eventual resignation, and what were the immediate political changes that followed?" 
  ],
  "financial economic crisis": [
    "Who were the lesser-known yet influential figures involved in managing and resolving the financial economic crisis, and what roles did they play?", 
    "Which countries experienced the most severe impacts of the financial crisis, and how did their recovery timelines compare over the subsequent decade?", 
    "How has the global perception of free-market capitalism changed as a result of the financial economic crisis, particularly in regions beyond the United States and Europe?", 
    "What were the key early warning signs or indicators that pointed towards the impending financial economic crisis before its actual onset?", 
    "What were the long-term economic impacts of the financial crisis on emerging markets?" 
  ],
  "h1n1 swine flu": [
    "How did the H1N1 swine flu virus evolve from its original strain identified in pigs to a form transmissible among humans?", 
    "How did the virus spread geographically from the initial outbreak location, and what were the key factors that influenced its global spread?", 
    "What were the effects of the H1N1 swine flu pandemic on the global economy, particularly in sectors such as travel, healthcare, and agriculture, in the years following the outbreak?", 
    "How has the H1N1 swine flu virus evolved since the 2009 pandemic, and what current strains exist in 2023?", 
    "Who were the primary scientists and researchers involved in the development of treatments and vaccines for the H1N1 swine flu, and what were their contributions?"
  ],
  "haiti earthquake": [
    "Who were the key figures leading the humanitarian response both within Haiti and internationally during the aftermath of the earthquake, and how has their involvement evolved over time?", 
    "What have been the social and economic impacts on the population of Haiti in the decade following the 2010 earthquake?", 
    "Who were the key local and international figures in managing the post-earthquake recovery in Haiti, and what were their roles?"
  ],
  "iraq war": [
    "What were the key military strategies employed during the major combat operations of the Iraq War, and how effective were they?", 
    "Who were the key political and military figures involved in the decision-making process for the Iraq War within the US and UK, and what roles did they play in the lead-up to the invasion?", 
    "How did the international community, including the UN, respond to the US-led invasion of Iraq and what were the major diplomatic efforts to address the crisis?", 
    "How did Iraq's domestic political landscape transform from the fall of Saddam Hussein's regime to the establishment of a new government?", 
    "What role did private military contractors play during the Iraq war, and how did their involvement impact military operations and post-war reconstruction?" 
  ],
  "libyan crisis": [
    "How did the various militias form in Libya following the outbreak of civil unrest in 2011, and what were their key influences in shaping the conflict?", 
    "What were the most significant challenges faced by the National Transitional Council in gaining international recognition and legitimacy post-Gaddafi?", 
    "How did the role and influence of Libyan tribes evolve during the different phases of the Libyan crisis?", 
    "Who are the key political figures and groups in Libya now, and how did they rise to prominence after the civil war?", 
    "What were the key sociopolitical conditions in Libya prior to the 2011 uprising that contributed to the eventual crisis?" 
  ],
  "michael jackson death": [
    "What were the events leading up to Michael Jackson's decision to hire Dr. Conrad Murray as his personal physician, particularly considering his history with other doctors?", 
    "What was the role and responsibility of AEG in managing and overseeing the health and well-being of Michael Jackson during the preparation for the 'This Is It' concert series?", 
    "What were the immediate measures taken by medical professionals upon Michael Jackson's cardiac arrest on June 25, 2009?", 
    "How has public perception and media coverage of Dr. Conrad Murray changed from the time of Michael Jackson's death to the present?", 
    "What were the specific interactions between Michael Jackson and Conrad Murray leading up to Murray becoming his personal physician?"
  ],
  "syrian crisis": [
    "What are the notable shifts in alliances among Syrian opposition groups since the beginning of the crisis?",
    "Which key figures have emerged during the Syrian crisis, and what roles have they played in shaping the conflict's trajectory?",
    "Who were the prominent leaders and figures involved in the Syrian opposition and how did their roles change over time?",
    "What were the initial domestic and international reactions to Bashar al-Assad's response to the protests at the onset of the Syrian crisis in 2011?",
    "What were the key turning points in international diplomacy regarding the Syrian crisis from 2011 to present?"
  ],
  "9/11 Memorial Museum Controversy": [
    "What were the key milestones and challenges in the construction timeline of the 9/11 Memorial Museum from its inception to opening?"
  ],
  "Texas ban abortions": [
    "What were the key legislative steps and debates that led to the passing of the Texas abortion ban in 2021?",
    "What role did advocacy groups, both for and against the ban, play in influencing the law's passage in Texas?",
    "What was the historical context and legal landscape regarding abortion laws in Texas leading up to the 2021 six-week abortion ban?",
    "What legal challenges have been brought against the Texas abortion ban since its enactment, and what outcomes have these challenges produced?",
    "How have public opinions and reactions to the Texas abortion ban shifted from its inception to the present, and what factors have contributed to these changes?"
  ],
  "Apple's pivotal product announcements": [
    "Who were the significant figures or teams behind Apple's most pivotal product announcements and how did their contributions shape Apple's product strategy?"
  ],
  "Astronauts stuck in space": [
    "What were the immediate actions and decisions taken by NASA and Boeing following the discovery of technical issues with Starliner's propulsion system?", 
    "How has NASA's collaboration with Boeing and SpaceX evolved since the contract awards for astronaut transportation after the shuttle retirement in 2011?", 
    "How has the current situation affected the timeline and execution of other planned missions to the International Space Station or related NASA objectives?", 
    "How has NASA planned to supply the astronauts with resources during their extended stay on the ISS?"
  ],
  "BP oil spill": [
    "What are the long-term economic impacts on local communities and industries in the Gulf region from the BP oil spill?", 
    "What specific legal actions have been taken against BP and its partners in the aftermath of the Deepwater Horizon oil spill?", 
    "How did the financial commitments and claims fund set by BP in response to the spill evolve over time, and what was their impact on affected communities?", 
    "What were the financial repercussions for BP in the years following the oil spill, including settlings and fines?", 
    "What strategies did BP implement to restore its corporate image following the oil spill?"
  ],
  "2023 Banking Crisis": [
    "What specific global regulatory responses were enacted following the initial banking collapses in March 2023, and how have they evolved over time?", 
    "What were the initial warning signs that preceded the 2023 banking crisis, and when did they first become evident?", 
    "What specific regulatory measures have been proposed or implemented in the aftermath of the 2023 banking crisis to prevent future occurrences?", 
    "What potential long-term effects might the 2023 banking crisis have on consumer confidence and behavior in the financial sector worldwide?", 
    "What were the global ripple effects on international banks following the collapse of major U.S. regional banks in 2023?"
  ],
  "Biden-Xi summit": [
    "How did the outcomes of the Bali meeting impact the strategic military relationships between the United States and China?",
    "Who were the central diplomatic figures involved in planning the Biden-Xi summit and what roles did they play?",
    "What were the motivations and expectations of both the U.S. and China leading up to the Biden-Xi summit?",
    "Who were the key advisors from both the United States and China involved in the preparation of the Biden-Xi summit, and what roles did they play?"
  ],
  "Biden classified documents incident": [
    "Who were the key individuals involved in the decision-making process regarding the handling and storage of the classified documents discovered in Biden's possession?",
    "What was the exact timeline and process through which the Biden team reviewed and handled the classified documents after their discovery?",
    "How has the discovery of classified documents impacted Joe Biden's presidency in terms of public trust and political capital up to now?",
    "Were there any prior instances or reports of mishandling classified documents during Biden's previous terms, and how were they addressed?",
    "What procedures and protocols were in place at the Penn Biden Center and Biden's residence to handle classified documents, and how did they potentially fail?"
  ],
  "Biden Withdraw from President Election": [
    "How did key figures in the Democratic Party react to Biden's withdrawal announcement?",
    "How did Biden’s withdrawal decision impact the dynamics and strategies of his opponent's campaigns, particularly Donald Trump’s campaign?",
    "What were the internal discussions and dynamics within the Democratic Party that led to the increased pressure on Biden to withdraw from the presidential race?",
    "How did Joe Biden's withdrawal affect the dynamics and strategy of the Democratic Party's 2024 election campaign?",
    "What were the main factors and criticisms from Democratic lawmakers and other influencers that contributed significantly to the pressure on Biden to withdraw from the race?"
  ],
  "Boeing 737 Max": [
    "How did Boeing's organizational culture and management decisions contribute to the development and subsequent failures of the 737 MAX?",
    "What were the specific design and manufacturing changes made to the Boeing 737 Max to address the issues identified after the crashes?",
    "How did Boeing's internal corporate culture evolve from the 1960s through its merger with McDonnell Douglas in the 1990s, and how might those changes have influenced the development and subsequent issues of the 737 Max?"
  ],
  "Boris Johnson's Career": [
    "What were the circumstances and factors that led to Boris Johnson's resignation as Prime Minister in 2022?",
    "What key events or factors led to Boris Johnson's election as Leader of the Conservative Party in 2019?",
    "How did Boris Johnson's policies as Mayor of London shape his later political positions and strategies?",
    "How did Boris Johnson's early career as a journalist impact his political style and public speaking approach?",
    "What were the specific circumstances and decisions leading to Boris Johnson becoming the leader of the Conservative Party?"
  ],
  "Brexit": [
    "In what ways have key bilateral relationships between the UK and individual EU member states been impacted since the implementation of Brexit?",
    "What were the initial motivations and arguments presented by the UK government and political parties for holding the EU referendum in 2016?",
    "What has been the impact of Brexit on Ireland, specifically regarding the Northern Ireland Protocol?",
    "What were the major political and economic factors that led to the initial call for a Brexit referendum in 2016, and how have those factors evolved since then?"
  ],
  "British Royal events as Kate appears in public": [
    "How has Kate Middleton's cancer diagnosis and subsequent public appearances impacted her public image and that of the royal family over the years?",
    "What were the medical details surrounding King Charles III's cancer diagnosis, including any public statements made by the royal family or their officials?",
    "What were the specific reasons for delaying the announcement of Kate Middleton's initial surgery in January 2024?",
    "What led to the digital manipulation controversy regarding the official photo of Kate Middleton with her children, and how did this incident affect public perception and media coverage?",
    "How have Kate Middleton's public appearances impacted the British royal family dynamics and public perception since her diagnosis and treatment?"
  ],
  "Strongest Earthquakes over last 20 years": [
    "How have international aid and disaster relief approaches evolved in response to the strongest earthquakes of the last two decades?",
    "Which countries have experienced the most economic impact due to the strongest earthquakes over the last 20 years?",
    "Which international collaborations and aid initiatives were most effective in the wake of the strongest earthquakes in the last 20 years?",
    "What roles have international organizations played in helping countries recover from the most significant earthquakes of the last 20 years?",
    ""
  ],
  "FTX Collapse": [
    "What were the specific steps taken by international authorities in response to the collapse of FTX, and how have these efforts evolved since the initial emergence of the crisis?"
  ],
  "Ferguson Unrest": [
    "What long-term policy changes, if any, were implemented in Ferguson or St. Louis County as a result of the unrest and subsequent investigations into the police department?",
    "What influence did the Ferguson unrest have on national conversations about race and policing policies in the United States over the past decade?"
  ],
  "George Floyd's arrest and murder": [
    "What were the events and interactions leading up to George Floyd's encounter with police on May 25, 2020?",
    "What role did each of the officers present during George Floyd's arrest play, and what were their respective defense arguments in court?"
  ],
  "Gilgo Beach killings": [
    "What were the key factors or events that led to the reopening and comprehensive review of the Gilgo Beach case in 2022?"
  ],
  "Greek Debt Crisis": [
    "What role did public sentiment and protest movements within Greece play in shaping the policies and decisions made during the debt crisis years, particularly between 2010 and 2015?",
    "What were the long-term economic and social consequences of the IMF and EU-imposed austerity measures on Greek society?",
    "Who were the major political figures and decision-makers in Greece from 2010 to 2015, and what were their roles in handling the debt crisis?"
  ],
  "Grenfell Tower Fire": [
    "Who were the key figures involved in the inquiry and legal proceedings after the Grenfell Tower fire, and what roles did they play in shaping the outcomes?",
    "What were the findings of the Grenfell Tower Inquiry's phases of investigation and their subsequent recommendations?",
    "What were the major safety and regulatory changes implemented by the UK government in response to the Grenfell Tower fire from 2017 to present, and what further changes are proposed for the future?",
    "What ongoing changes have been made to UK building safety regulations from 2017 to present as a direct result of the Grenfell Tower fire?"
  ],
  "Hillsborough disaster": [
    "What were the initial responses and actions taken by emergency services immediately following the Hillsborough disaster?",
    "What impact did the Hillsborough disaster have on the families of the victims in terms of advocacy and legal actions?",
    "What have been the long-term changes or reforms in stadium safety regulations and crowd management as a result of the Hillsborough disaster?",
    "What were the key findings and recommendations from the various inquests and investigations conducted over the years since the Hillsborough disaster?"
  ],
  "Huw Edwards Scandal": [
    "What was the initial internal response within the BBC when the first allegations against Huw Edwards surfaced?",
    "What were the initial allegations against Huw Edwards that led to the police investigation, and how did they evolve over time?",
    "How did Huw Edwards' legal defense team address the allegations and what defense strategies did they employ throughout the process?",
    "How did public and media perceptions of Huw Edwards evolve from before the scandal, during its peak, and after his guilty plea?"
  ],
  "Iran-Iraq War": [
    "What were the early diplomatic efforts, if any, to prevent the outbreak of the Iran-Iraq War in 1980?"
  ],
  "2024 Iran-Israel Conflict": [
    "What were the initial political and military actions taken by both Iran and Israel that led to the escalation of the conflict into open hostilities in 2024?"
  ],
  "Iraq War": [
    "What were the significant military strategies and decisions made during the early phases of the Iraq War, and how did they shape subsequent operations?",
    "How did the internal political dynamics within Iraq evolve leading up to the 2003 invasion?",
    "What were the long-term political impacts within Iraq following the withdrawal of US troops in 2011?",
    "What long-term impacts did the Iraq War have on U.S. military strategy and foreign policy, especially concerning future military interventions?"
  ],
  "Islamic State": [
    "How has the leadership structure of the Islamic State changed over time, particularly after the death of key figures such as Abu Bakr al-Baghdadi?",
    "What were the main factors that led to the decision of the Islamic State to declare the establishment of a caliphate in 2014?",
    "What were the key factors and events that contributed to the rise of the Islamic State, particularly in Iraq and Syria, between 2006 and 2014?",
    "What has been the impact of Islamic State's activities on regional stability and civilian populations in the affected areas from 2014 onwards?"
  ],
  "Ja Morant's Career": [
    "What off-court activities or programs has Ja Morant been involved in, and how have they impacted his public image or career?",
    "How has Ja Morant's playing style and role within the Memphis Grizzlies evolved from his rookie season to the present?",
    "What factors contributed to Ja Morant being named the 2019-20 NBA Rookie of the Year, and how did this achievement affect his career trajectory?"
  ],
  "Impeachment of Ken Paxton": [
    "What specific allegations and evidence were presented in the articles of impeachment filed against Ken Paxton, and how did they evolve over time?",
    "What events or actions led to the initiation of the legislative probe that resulted in Ken Paxton's impeachment?"
  ],
  "King Charles Health Issue": [
    "How has King Charles' overall medical history influenced his current health condition?",
    "What were the specific symptoms or medical indications that led to King Charles seeking medical examination, resulting in the cancer diagnosis?",
    "What specific type of cancer has King Charles been diagnosed with, and what are the potential implications for his health prognosis?",
    "What were the early signs or symptoms that led King Charles to seek medical attention for his prostate condition initially?"
  ],
  "Kobe Bryant helicopter crash": [
    "What were the key findings from the final report issued by the authorities on the causes of the Kobe Bryant helicopter crash?",
    "What safety recommendations have been proposed by aviation authorities following the Kobe Bryant helicopter crash investigation?"
  ],
  "The search for MH370": [
    "What were the initial procedures and protocols followed immediately after the disappearance of MH370 in March 2014?",
    "What were the initial search strategies and their evolution over the years in the search for MH370?",
    "How has the international collaboration evolved in the MH370 search efforts since the initial disappearance in 2014?",
    "How has satellite technology evolved since 2014 to aid in the search for lost aircraft like MH370, and what future advancements are anticipated?"
  ],
  "Matthew Perry Death": [
    "What was the timeline and sequence of events leading up to Matthew Perry's death?",
    "Can we trace the timeline of events from the day Matthew Perry was found deceased to the release of the final autopsy report?",
    "Can you provide a detailed timeline of interactions or visits between Matthew Perry and Dr. Mark Chavez before Perry's death?",
    "What legal actions were taken against Dr. Mark Chavez following his guilty plea concerning Matthew Perry's death?"
  ],
  "Inter Miami sign Lionel Messi": [
    "Who were the primary negotiators from both Lionel Messi's and Inter Miami's sides during the contract discussions?",
    "How has Lionel Messi's presence influenced the youth soccer development programs in the Miami area since joining Inter Miami?"
  ],
  "NBA all-time leading scorers": [
    "Which teams or coaches played pivotal roles in the careers of NBA all-time leading scorers and how did they contribute to their scoring success?",
    "How has the NBA's all-time leading scorers list evolved over the decades, starting from the league's inception?",
    "Which team has the highest number of players who have been in the top 20 all-time NBA scorers, and what is the historical context behind this?",
    "How has the role of different basketball positions (e.g., guard, forward, center) evolved among the NBA's all-time leading scorers over different decades?"
  ],
  "Pakistan's parliamentary election": [
    "How have Pakistan's political parties prepared to address the alleged involvement of the military in electoral processes for the 2024 elections?",
    "What role has the military played in previous parliamentary elections in Pakistan, and how has this role changed or remained the same over time?",
    "What were the key events and political decisions that led to the decision to dissolve Pakistan's National Assembly in August 2023?",
    "Who are the emerging political figures in Pakistan's 2024 elections, and how might they influence future political dynamics?",
    "What factors contributed to the decision to delay Pakistan's parliamentary elections originally scheduled for November to later dates?"
  ],
  "Petraeus-Broadwell Scandal": [
    "What role, if any, did technology companies or third-party entities play in assisting the FBI investigation into the Petraeus scandal, especially concerning the identification and tracking of email correspondences?",
    "What were the initial interactions and circumstances that led to the development of the relationship between David Petraeus and Paula Broadwell?",
    "What role did Jill Kelley play in the unfolding of the Petraeus-Broadwell scandal?",
    "What were the initial motivations and objectives behind Paula Broadwell's biography project with David Petraeus?",
    "What were the security protocols or failures at the CIA during Petraeus's tenure that allowed the data leak to occur without immediate detection?"
  ],
  "Pope Emeritus Benedict XVI": [
    "How did Benedict XVI spend his retirement years, and what contributions did he make to the Church during this period?",
    "Who were the key figures and allies who influenced or supported Benedict XVI's decisions throughout his religious career?",
    "How did Pope Benedict XVI's resignation impact the Vatican's protocol regarding future papal resignations and the role of the pope emeritus?",
    "What were the key factors that influenced Pope Benedict XVI's decision to resign from the papacy in 2013?",
    "What specific challenges and controversies did Pope Benedict XVI face during his papacy related to clerical abuse, and how did he address them?"
  ],
  "Russian Ukraine Crisis": [
    "In what ways have key geopolitical alliances shifted globally as a result of the Russian invasion of Ukraine, and what are the long-term implications of these shifts?",
    "How have international sanctions against Russia been adjusted or expanded since the invasion of Ukraine began, and which nations are primarily involved?",
    "How has Ukraine's domestic political landscape changed in response to the ongoing conflict with Russia since 2022?",
    "What were the key political and military strategies employed by Russia and Ukraine in the lead-up to the initial 2022 invasion?"
  ],
  "Rwanda plan": [
    "What are the documented impacts of the Rwanda plan on the asylum seekers affected, both in the UK and upon their arrival in Rwanda?",
    "What were the primary motivations behind the UK government's decision to initiate the Rwanda plan?"
  ],
  "SNP finances controversy": [
    "What measures did the SNP undertake internally from 2021 to 2024 in response to the ongoing finance investigation?",
    "What specific legal proceedings and outcomes have occurred related to the alleged embezzlement of SNP funds since charges were first brought against members?",
    "What were the circumstances and motivations surrounding the purchase of the £100k motorhome involved in the SNP finances controversy, and how has this asset factored into the legal and financial scrutiny faced by the party?"
  ],
  "Taliban returned to power": [
    "How have the educational opportunities for women and girls in Afghanistan changed since the Taliban took over, and what efforts have been made to address these changes?",
    "How has the Taliban's governance approach evolved since their first regime in the 1990s to their return to power in 2021?",
    "What influence has the Taliban's return to power had on global jihadist movements, and how have these groups interacted with Afghanistan post-2021?"
  ],
  "Trump's Hush Money Trial": [
    "Who were the key individuals involved in the initial investigation of the hush money payments and what roles did they play?",
    "How did Stormy Daniels and Karen McDougal's involvement in the case shape public and media perception before and during the trial?",
    "How did Michael Cohen finance the payments to Stormy Daniels and others, and what impact did this have on his personal and professional life before becoming a witness?",
    "What was the timeline and specific sequence of events that led to the decision to file charges against Trump in the hush money case?",
    "How have similar legal cases involving 'hush money' payments unfolded in the past, and what impacts have they had on legal precedents or political figures?"
  ],
  "Donald Trump's indictment in Georgia": [
    "What is the historical significance of Georgia's legal system tackling a case involving a former U.S. President, and how has the state's judiciary prepared for this case?",
    "What were the key events and communications that led up to the grand jury's decision to indict Donald Trump in Georgia?",
    "How did the investigation into Trump's actions in Georgia begin, and what key events occurred during the course of the investigation?",
    "Who are the leading legal figures involved in prosecuting the Georgia indictment case, and what are their strategies?",
    "Who are the key figures in the Georgia investigation besides Donald Trump and Rudy Giuliani, and what roles did they play in the events leading to the indictment?"
  ],
  "Donald Trump and Ukraine": [
    "How did international perceptions of U.S. foreign policy towards Ukraine shift as a result of the Trump-Ukraine scandal?",
    "How did the internal politics and response within Ukraine evolve during and after the Trump-Ukraine phone call was revealed?",
    "How did President Donald Trump’s policy towards Ukraine evolve during his administration from 2017 to 2019?",
    "What were the diplomatic interactions between Donald Trump's administration and Ukraine prior to the 2019 phone call controversy?"
  ],
  "Turkey attacks": [
    "What were the main triggers and historical events leading to Turkey's decision to launch aerial attacks against the PKK in 2015?"
  ],
  "Acquisition of Twitter": [
    "What legal challenges or obstacles did Elon Musk face during the acquisition process, and how were they resolved?",
    "What were the key financial arrangements and sources of funding that enabled Elon Musk to finance the $44 billion deal?",
    "What has been the global reaction from Twitter users, advertisers, and regulatory bodies to the news of Elon Musk's acquisition, and how has it impacted Twitter's user engagement and business strategy since the deal closed?",
    "How did the negotiations between Elon Musk and Twitter's board evolve from the initial offer to the final agreement?",
    "How did the negotiation process between Elon Musk and Twitter's board evolve from the initial offer to the final closure of the deal?"
  ],
  "Tyre Nichols arrest and death": [
    "What is the timeline and key developments in the legal proceedings against the former officers charged in connection to Tyre Nichols' death?"
  ],
  "U.S.-Iran Relations": [
    "How have U.S.-Iran relations evolved in response to the global rise of terrorism and the designation of Iran as part of the 'axis of evil' in the early 2000s?",
    "What historical events prior to the 1979 hostilities significantly influenced the foreign policy approaches of both the U.S. and Iran?",
    "What were the key motivations and objectives for the U.S. and Iran during the initial stages of their relationship following the 1979 Iranian Revolution?",
    "How did the Iran-Iraq War from 1980 to 1988 impact the U.S.-Iran relations during and after the conflict?"
  ],
  "U.S. Response to Syria's Civil War": [
    "How did the U.S.'s policy and military strategy towards Syria evolve during the Obama administration from 2011 to 2017?",
    "How did the U.S.'s international alliances influence its policies and actions related to the Syrian civil war?",
    "How did U.S. partnerships with other countries and international organizations influence its response to Syria's civil war?",
    "What were the key actions and decisions made by the U.S. regarding military intervention in Syria from 2011 to 2023?",
    "How did the involvement of different U.S. administrations (Obama to Biden) alter the U.S. strategy in addressing the Syrian Civil War?"
  ],
  "Post-Independence Ukraine": [
    "How did Ukraine's political affiliations and foreign policy evolve from post-independence in 1991 to the present day?",
    "How have the international relationships of Ukraine evolved since its independence in 1991, particularly with the European Union and NATO?",
    "Who are some of the key figures in Ukraine's political landscape post-independence, and what impacts have they had on the country's development?",
    "Who played a significant role in shaping the cultural identity of Ukraine post-independence, and what were their contributions?",
    "How did Ukraine's foreign policy and international relations evolve from 1991 to the present?"
  ]
}